- pandas 는 기본으로 설치되어있음
- 프레임워크는 자주자주 업데이트되므로 공식문서를 자주 참고하세여

# 판다스 자료구조

- 분석을 위해 수집하는 데이터는 형태나 속성이 매우 다양함
- 서로 다른 형식을 갖는 여러 종류의 데이터를 컴퓨터가 이해할 수 있도록 동일한 형식을 갖는 구조로 통합할 필요가 있음(엑셀)

- 엑셀금지 : 무겁다!, 큰거 못연다!
- R : 대용량 데이터 다루기 힘들다, 분기처리는 힘들다
- Python : 파이썬이 짱이다!

- 판다스 데이터의 형식
    - 시리즈(Series)
        - 1차원 배열
        - 
    - 데이터프레임(DataFrame)
        - 2차원 배열

## 시리즈

<img src="./images/series.jpg">

- 데이터가 순차적으로 나열된 1차원 배열
    - 각 인덱스는 값 과 1:1 대응이 됨
        - 이런 관점에서 키와 값이 짝을 이루는 딕셔너리와 비슷한 구조라고도 볼 수 있음
    
    - 시리즈에서 인덱스는 데이터 값의 위치를 나타내는 이름표 역할을 수행

- 시리즈 생성
- pandas.Series()

In [3]:
import pandas as pd # 강력한 관습!
import numpy as np 
import seaborn as sns # 시각화

### 시리즈 생성

In [5]:
# 딕셔너리 생성

dict_data = {"a":1,"b":2,"c":3 }

In [6]:
dict_data

{'a': 1, 'b': 2, 'c': 3}

In [7]:
# 딕셔너리 데이터를 판다스 시리즈로 변환
sr = pd.Series(dict_data)

In [11]:
sr # 왼쪽 index 오른쪽 value / dtype : datatype

a    1
b    2
c    3
dtype: int64

In [9]:
print(type(sr))

<class 'pandas.core.series.Series'>

- 나무보다 숲을 보는 관점으로 전환하시오
- 하나의 데이터 타입으로 통일 됩니다

In [12]:
# 시리즈를 구성하는 데이터 값의 자료형 확인
sr.dtypes

dtype('int64')

In [13]:
# 문자열 = object 라고 표현함
# 모든 시리즈가 64비트로 이루어짐

Index(['a', 'b', 'c'], dtype='object')

In [14]:
# 시리즈의 인덱스 배열
sr.index

Index(['a', 'b', 'c'], dtype='object')

In [15]:
# 시리즈의 값 배열 
sr.values

array([1, 2, 3])

- 리스트를 시리즈로 변환하면 인덱스로 변환될 값이 없음
- 인덱스가 별도로 정의되지 않으면 정수형 위치 인덱스가 자동으로 지정

In [16]:
# 리스트르르 시리즈로 변환
list_data = ["20",3.14, "ABC", True, 100]

In [17]:
sr = pd.Series(list_data)

In [18]:
print(sr)

0      20
1    3.14
2     ABC
3    True
4     100
dtype: object

In [19]:
sr.index # 별도의 index 가 없으면 정수형이 배정된다 ...

RangeIndex(start=0, stop=5, step=1)

In [20]:
sr.values

array(['20', 3.14, 'ABC', True, 100], dtype=object)

In [21]:
sr.dtype

dtype('O')

In [22]:
# 튜플을 시리즈로 변환
tup_data = ("영인", "2025-05-10", True)

In [27]:
sr = pd.Series(tup_data , index=["이름", "생년월일", "학생여부"]) # data 개수와 index 개수가 안맞으면 오류남

In [26]:
sr

이름              영인
생년월일    2025-05-10
학생여부          True
dtype: object

### 원소 선택

- 인덱스를 이용하여 원소를 선택할 수 있음
    - 하나의 원소를 선택
    - 여러 원소를 한꺼번에 선택
    - 인덱스 범위를 지정하여 원소를 선택
    - 슬라이싱과 유사

- 정수형 위치 인덱스는 대괄호 안에 위츠를 나타내는 숫자를 입력
- 인젝스 이름은 따옴표와 함게 입력

In [28]:
print(sr)

이름              영인
생년월일    2025-05-10
학생여부          True
dtype: object

In [29]:
# 원소 1개 선택

sr["이름"]

'영인'

In [32]:
# 여러 원소 선택(인덱스 리스트 활용)

sr[["생년월일", "학생여부"]] # 여러개는 [[]] # 바깥 대괄호는 선택연산자의 역할 안쪽에는 원소연산자의 역할

생년월일    2025-05-10
학생여부          True
dtype: object

In [34]:
# 여러 원소의 (인덱스범위 지정)
sr["생년월일":"학생여부"] # 시작:종료 =>종료원소의 값까지 포함됨
# 인덱스 이름을 사용하면 범위의 끝이 포함됨

생년월일    2025-05-10
학생여부          True
dtype: object

In [35]:
sr[0:3]

이름              영인
생년월일    2025-05-10
학생여부          True
dtype: object

## 데이터프레임

<img src="./images/dataframe.jpg">

- 행과 열로 이루어진 2차원 배열
- 여러개의 시리즈들이 모여서 데이터 프레임을 구성
- 데이터 프레임의 열은 각각 시리즈 객체
- 여러개의 시리즈들이 같은 행 인덱스를 기준으로 결합된 2차원 행렬

-  행과 열을 나타내기 위해 두 가지 종류의 주소를 사용

-  행 인덱스
    -  개별 관측대상에 대한 다양한 속성 데이터들의 모음
    -  레코드(record) = 관측치
-  열 이름
    -  공통의 속성을 갖는 일련의 데이터
  
-  예) 주식 종목 데이터
-  행 : 각 주식 종목에 댁한 관측값
-  열 : 회사이름, 총 주식수, 액면가 등등

### 데이터 프레임 생성

- 동일한 길이의 1차원 배열 어러 개가 필요
- pandas.DataFrame(2차원 배열)

In [36]:
dict_data = {"c0": [1,2,3], 
             "c1": [2,3,4],
             "c2": [1,2,3],
             "c3": [1,2,3],
             "c4": [1,2,3],
            }
# 딕셔너리를 데이터 프레임으로 변환
df = pd.DataFrame(dict_data)

In [40]:
print(df)
type(df)

   c0  c1  c2  c3  c4
0   1   2   1   1   1
1   2   3   2   2   2
2   3   4   3   3   3

pandas.core.frame.DataFrame

In [41]:
df

   c0  c1  c2  c3  c4
0   1   2   1   1   1
1   2   3   2   2   2
2   3   4   3   3   3

In [42]:
# pandas 를 다룰때는 열단위연산이 편하다

### 행 인덱스/열 이름 설정

- pandas.DataFrame(2차원배열, index = 행 인덱스 배열, columns = 열 이름 배열)

In [55]:
df = pd.DataFrame(
    [[15, "남", "덕영중"],
    [15, "여", "동국중"]], 
    index = ["준서", "예은"],
    columns = ["나이", "성별","학교"]
)

In [56]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  15  여  동국중

In [58]:
df.index

Index(['준서', '예은'], dtype='object')

In [57]:
df.values

array([[15, '남', '덕영중'],
       [15, '여', '동국중']], dtype=object)

In [60]:
df.columns

Index(['나이', '성별', '학교'], dtype='object')

#### 행 인덱스 / 열 이름 변경

- df.index = 새 행 인덱스 배열
- df.columns = 새 열 이름 배열

In [61]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  15  여  동국중

In [62]:
# 행 인덱스 변경
df.index = ["학생1", "학생2"]

In [63]:
df

     나이 성별   학교
학생1  15  남  덕영중
학생2  15  여  동국중

In [67]:
# 열 인덱스 변경
df.columns = ["연령","남녀","소속"]

In [65]:
df

      1  2    3
학생1  15  남  덕영중
학생2  15  여  동국중

In [68]:
df.index

Index(['학생1', '학생2'], dtype='object')

In [69]:
df.columns

Index(['연령', '남녀', '소속'], dtype='object')

### 행 인덱스/ 열 이름 변경(rename 메소드 활용)

- df.rename(index = {기존 인덱스 : 새 인텍스, ...})
- df.rename{column = {기존 이름 : 새 이름, ... })

In [70]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  15  여  동국중

In [77]:
df.rename(columns = {"연령": "나이", "남녀" : "성별", "소속" : "학교"})

     나이 성별   학교
학생1  15  남  덕영중
학생2  15  여  동국중

In [79]:
# 원본 객체를 수정하려면 inplace = True 옵션

df.rename(columns = {"연령": "나이", "남녀" : "성별", "소속" : "학교"}, inplace = True) # 강사 개인적으로 선호하지 않음

In [80]:
df

     나이 성별   학교
학생1  15  남  덕영중
학생2  15  여  동국중

In [86]:
dddd = df.rename(index =  {"학생1" : "준서", "학생2":"예은"}) # 재할당 방법을 써도 좋다

In [87]:
dddd

    나이 성별   학교
준서  15  남  덕영중
예은  15  여  동국중

### 행 / 열 삭제

- drop() 메소드
    - axis = 0
    - 행 삭제

    - axis = 1
    - 열 삭제

- (행,열) => axis(0,1) 이렇게 이해해봐용

- 동시에 여러 행 또는 열 삭제
- 리스트 형태로 입력
- 기존 객체를 변경하지 않고 새로운 객체를 반환


- df.drop(행 인덱스 또는 배열, axis=0)
- df.drop(열 인덱스 또는 배열, axis=1)

In [98]:
exam_data = {"수학" :  [90,80,50],
             "음악" :  [90,80,50],
             "영어" :  [90,80,50],
             "체육" :  [90,80,50],
            }

df = pd.DataFrame(exam_data, index =  ["서준","우현","안아"])

In [99]:
df

    수학  음악  영어  체육
서준  90  90  90  90
우현  80  80  80  80
안아  50  50  50  50

In [103]:
df2 = df.copy()

In [104]:
id(df2), id(df)

(2118504771088, 2118410513648)

#### 행 삭제

In [105]:
df2

    수학  음악  영어  체육
서준  90  90  90  90
우현  80  80  80  80
안아  50  50  50  50

In [106]:
df2 = df2.drop("우현") # axis 가 0 이 기본값임 ( 기본 행삭제 )

In [95]:
df2

    수학  음악  영어  체육
서준  90  90  90  90
안아  50  50  50  50

In [107]:
df3 = df[:]

In [108]:
df3

    수학  음악  영어  체육
서준  90  90  90  90
우현  80  80  80  80
안아  50  50  50  50

In [109]:
id(df), id(df3)

(2118410513648, 2118519840576)

In [113]:
df3.drop(["우현", "안아"])

    수학  음악  영어  체육
서준  90  90  90  90

In [115]:
df3.drop("서준", axis=0)

    수학  음악  영어  체육
우현  80  80  80  80
안아  50  50  50  50

#### 열 삭제

In [116]:
df4 = df.copy()

In [117]:
df4

    수학  음악  영어  체육
서준  90  90  90  90
우현  80  80  80  80
안아  50  50  50  50

In [118]:
df4 = df4.drop("수학", axis = 1)

In [119]:
df4

    음악  영어  체육
서준  90  90  90
우현  80  80  80
안아  50  50  50

In [121]:
df4 = df4.drop(["음악","영어"], axis = 1)

In [122]:
df4

    체육
서준  90
우현  80
안아  50

In [123]:
df5 = df[:]

In [124]:
df5 = df5.drop(["음악", "체육"], axis = 1)

In [125]:
df5

    수학  영어
서준  90  90
우현  80  80
안아  50  50

### 행 선택

- loc
- 인덱스 이름을 사용

- iloc
- 정수형 위치 인덱스를 사용

|구분|loc|iloc|
|:--:|:--:|:--:|
|탐색 대상| 인덱스 이름 | 정수형 위치 인덱스|
|범위 지정|가능 (범위의 끝 포함)|가능(범위의 끝 제외)|

In [131]:
df.loc["서준":"안아"]

    수학  음악  영어  체육
서준  90  90  90  90
우현  80  80  80  80
안아  50  50  50  50

In [136]:
df.iloc[0:1]

    수학  음악  영어  체육
서준  90  90  90  90

#### 하나의 행 선택

In [141]:
label1 = df.loc["서준"]

In [138]:
position1 = df.iloc[0]

In [143]:
label1

수학    90
음악    90
영어    90
체육    90
Name: 서준, dtype: int64

In [144]:
position1

수학    90
음악    90
영어    90
체육    90
Name: 서준, dtype: int64

In [146]:
# 하나의 행을 선택했더니 시리즈가 된다!!!! : 하나의 행은 시리즈가 된다

#### 2개 이상의 행 선택

In [155]:
label2 = df.loc["서준":"안아"]
label2_1 = df.loc[["서준", "안아"]]
position2 = df.iloc[0:2]
position2_1 = df.iloc[[0,2]]

In [148]:
label2

    수학  음악  영어  체육
서준  90  90  90  90
우현  80  80  80  80
안아  50  50  50  50

In [154]:
label2_1

    수학  음악  영어  체육
서준  90  90  90  90
안아  50  50  50  50

In [158]:
position2

    수학  음악  영어  체육
서준  90  90  90  90
우현  80  80  80  80

In [156]:
position2_1

    수학  음악  영어  체육
서준  90  90  90  90
안아  50  50  50  50

In [157]:
# 정답을 찾으려고 하면 안됨~

#### 행 인덱스의 범위를 지정하여 행 선택

In [159]:
label3 = df.loc["서준":"우현"]
position3 = df.iloc[0:1]

In [160]:
label3

    수학  음악  영어  체육
서준  90  90  90  90
우현  80  80  80  80

In [161]:
position3

    수학  음악  영어  체육
서준  90  90  90  90

### 열 선택

- 열 데이터를 1개만 선택하는 경우
- 대괄호 안에 열 이름을 따옴표와 함께 입력

- 도트(.) 다음에 열 이름을 입력
    - 열 이름이 문자열일 경우에만 가능 ( 띄어쓰기있는애는안됨, 문자열만됨 )

- 여러 열을 선택하는 경우
    - 대괄호 안에 열 이름 리스트 입력
    - 리스트의 원소로 열 이름이 하나만 있는 경우에는 시리즈가 아니라 데이터 프레임이 됨

In [163]:
exam_data = {
             "이름" : ["서준", "우현", "인아"],
             "수학" :  [90,80,50],
             "음악" :  [90,80,50],
             "영어" :  [90,80,50],
             "체육" :  [90,80,50],
            }

df = pd.DataFrame(exam_data)

In [164]:
df

   이름  수학  음악  영어  체육
0  서준  90  90  90  90
1  우현  80  80  80  80
2  인아  50  50  50  50

In [165]:
# 수학 점수 데이터만 선택
math1 = df["수학"]

In [166]:
math1

0    90
1    80
2    50
Name: 수학, dtype: int64

In [167]:
type(math1)

pandas.core.series.Series

In [168]:
# 영어 점수 데이터만 선택
english = df.영어

In [169]:
english

0    90
1    80
2    50
Name: 영어, dtype: int64

In [170]:
type(english)

pandas.core.series.Series

In [171]:
# 2개 이상의 열 추출

music_gym = df[["음악","체육"]]

In [172]:
music_gym

   음악  체육
0  90  90
1  80  80
2  50  50

In [174]:
type(music_gym)

pandas.core.frame.DataFrame

In [175]:
# 수학 점수 데이터만 데이터 프레임으로 추출

math2 = df["수학"] # 시리즈로 출력됨


math2 = df[["수학"]] # 데이터프레임으로 출력됨 안쪽의 대괄호가 나열의 의미가 있음

In [176]:
math2

   수학
0  90
1  80
2  50

#### 범위 슬라이싱

In [177]:
df

   이름  수학  음악  영어  체육
0  서준  90  90  90  90
1  우현  80  80  80  80
2  인아  50  50  50  50

In [179]:
df.iloc[::2]

   이름  수학  음악  영어  체육
0  서준  90  90  90  90
2  인아  50  50  50  50

In [180]:
df.loc[::2]

   이름  수학  음악  영어  체육
0  서준  90  90  90  90
2  인아  50  50  50  50

In [181]:
df.iloc[::-1]

   이름  수학  음악  영어  체육
2  인아  50  50  50  50
1  우현  80  80  80  80
0  서준  90  90  90  90

#### 원소 선택

- 데이터 프레임의 행 인덱스와 열 이름을 [행, 열] 형식의 2차원 좌표로 입력하여 원소를 지정
- 원소가 위치하는 행과 열의 좌표를 입력하면 해당 위치의 원소가 반환
- 1개의 행과 2개이상의 열 또는 2개 이상의 행과 1개의 열을 선택하면 시리즈 객체가 반환
- 2개 이상의 행과 열을 선택하면 데이터 프레임 객체를 반환

In [182]:
df

   이름  수학  음악  영어  체육
0  서준  90  90  90  90
1  우현  80  80  80  80
2  인아  50  50  50  50

In [184]:
# set_index() : 특정 컬럼을 새로운 인덱스로 지정

df = df.set_index("이름")

print(df)

    수학  음악  영어  체육
이름
서준  90  90  90  90
우현  80  80  80  80
인아  50  50  50  50

In [185]:
df

    수학  음악  영어  체육
이름
서준  90  90  90  90
우현  80  80  80  80
인아  50  50  50  50

In [189]:
# 서준이의 음악점수 
df.loc["서준", "음악"]

np.int64(90)

In [192]:
df.iloc[0,1]

np.int64(90)

In [198]:
# 서준의 음악, 체육 점수
df.loc["서준", ["음악","체육"]]

음악    90
체육    90
Name: 서준, dtype: int64

In [199]:
df.loc[["서준"],["음악","체육"]]

    음악  체육
이름
서준  90  90

In [200]:
df.iloc[0, [1,3]]

음악    90
체육    90
Name: 서준, dtype: int64

In [203]:
df.iloc[[0],[1,3]]

    음악  체육
이름
서준  90  90

In [204]:
df.loc["서준", "음악":"체육"]

음악    90
영어    90
체육    90
Name: 서준, dtype: int64

In [205]:
df.iloc[0, 2:]

영어    90
체육    90
Name: 서준, dtype: int64

In [206]:
# 서준, 우현의 음악 체육

In [207]:
df.loc[["서준","우현"], ["음악","체육"]]

    음악  체육
이름
서준  90  90
우현  80  80

In [209]:
df.iloc[[0,1],[2,3]]

    영어  체육
이름
서준  90  90
우현  80  80

In [211]:
df.loc["서준":"우현", "음악":"체육"]

    음악  영어  체육
이름
서준  90  90  90
우현  80  80  80

In [212]:
df.iloc[0:2,  2:]

    영어  체육
이름
서준  90  90
우현  80  80

### 열 추가

- df["추가하려는열이름"] = 데이터 값 또는 배열
- 단일 값을 입력하면 모든 행의 동일한 값이 입력됨

In [213]:
df

    수학  음악  영어  체육
이름
서준  90  90  90  90
우현  80  80  80  80
인아  50  50  50  50

In [217]:
df["국어"] = 80

In [218]:
df

    수학  음악  영어  체육  국어
이름
서준  90  90  90  90  80
우현  80  80  80  80  80
인아  50  50  50  50  80

In [219]:
# 우와 추가되었다! 똑같은 값이 입력되네???

In [220]:
df["과학"] = [30,99] # 데이터 개수를 안맞추면 지랄이난다

ValueError: Length of values (2) does not match length of index (3)

In [221]:
df["과학"] = [30,99,30]

In [222]:
df

    수학  음악  영어  체육  국어  과학
이름
서준  90  90  90  90  80  30
우현  80  80  80  80  80  99
인아  50  50  50  50  80  30

In [223]:
# 엥? 행추가 가 없어져요?

### 행 추가

- 추가하려는 행 이름과 데이터 값을 loc 을 사용해서 입력

- df.loc["새로운행이름"] = 데이터값 배열

In [302]:
exam_data = {"수학" :  [90,80,50],
             "음악" :  [90,80,50],
             "과학" :  [90,80,50],
            }

df = pd.DataFrame(exam_data, index=["경민","화정","민지"])

In [228]:
df

    수학  음악
경민  90  90
화정  80  80
민지  50  50

In [229]:
df.loc["우왕"] = 0

In [230]:
df

    수학  음악
경민  90  90
화정  80  80
민지  50  50
우왕   0   0

In [235]:
df.loc[4] = [90, 90]

In [236]:
df

    수학  음악
경민  90  90
화정  80  80
민지  50  50
우왕   0   0
4   90  90

### 원소 값 변경

- 데이터프레임의 특정 원소를 선택하고 새로운 데이터 값을 지정
- 원소 1개를 선택하거나 여러 원소를 선택하여 한꺼번에 값을 바꿈

In [241]:
exam_data = {
    "이름" : ["경민","화정","민지"],
    "수학" :  [90,80,50],
             "음악" :  [90,80,50],
            }

df = pd.DataFrame(exam_data)
df = df.set_index("이름")

In [242]:
df

    수학  음악
이름
경민  90  90
화정  80  80
민지  50  50

In [243]:
# 서준의 체육점수 수정

In [244]:
df.loc["경민"] = 75

In [245]:
df

    수학  음악
이름
경민  75  75
화정  80  80
민지  50  50

In [246]:
df.loc["경민", "수학"] = 20

In [247]:
df

    수학  음악
이름
경민  20  75
화정  80  80
민지  50  50

In [252]:
df.loc["민지","음악"] = 300

In [253]:
df

      수학     음악
이름
경민  20.0   75.0
화정  80.0   80.0
민지  50.0  300.0
서준   NaN  300.0

In [254]:
# 서준의 음악, 체육 점수변경

df.loc["서준", ["음악", "체육"]] = 50

In [257]:
df

      수학     음악    체육
이름
경민  20.0   75.0   NaN
화정  80.0   80.0   NaN
민지  50.0  300.0   NaN
서준   NaN   50.0  50.0

In [260]:
df.loc["경민", ["음악","체육"]] = [100,50]

df.loc["경민", ["음악","체육"]] = (100,50)

In [261]:
df

      수학     음악    체육
이름
경민  20.0  100.0  50.0
화정  80.0   80.0   NaN
민지  50.0  300.0   NaN
서준   NaN   50.0  50.0

### 행 열의 위치 바꾸기
- 데이터 프레임의 행과 열을 서로 맞바꾸는 방법
    - 열 이름이 행 인덱스로 이동하고 행 인덱스가 열 이름으로 이동

- 선형대수학의 전치행렬과 같은 개념
- 전치의 결과로 새로운 객체를 반환

- df.transpose() 또는 df.T

In [262]:
df.transpose()

이름     경민    화정     민지    서준
수학   20.0  80.0   50.0   NaN
음악  100.0  80.0  300.0  50.0
체육   50.0   NaN    NaN  50.0

In [263]:
df.T

이름     경민    화정     민지    서준
수학   20.0  80.0   50.0   NaN
음악  100.0  80.0  300.0  50.0
체육   50.0   NaN    NaN  50.0

In [266]:
# df를 전치(메소드 활용)
df.transpose()

이름     경민    화정     민지    서준
수학   20.0  80.0   50.0   NaN
음악  100.0  80.0  300.0  50.0
체육   50.0   NaN    NaN  50.0

In [267]:
# 원본 데이터는 그대로 
df

      수학     음악    체육
이름
경민  20.0  100.0  50.0
화정  80.0   80.0   NaN
민지  50.0  300.0   NaN
서준   NaN   50.0  50.0

In [272]:
df = df.transpose() # 재할당해서 원본을 건든다

In [273]:
df

이름     경민    화정     민지    서준
수학   20.0  80.0   50.0   NaN
음악  100.0  80.0  300.0  50.0
체육   50.0   NaN    NaN  50.0

In [274]:
# df 를 전치 (클래스 속성 활용)
df = df.T

In [275]:
df

      수학     음악    체육
이름
경민  20.0  100.0  50.0
화정  80.0   80.0   NaN
민지  50.0  300.0   NaN
서준   NaN   50.0  50.0

# 인덱스 활용

## 특정 열을 행 인덱스로 설정

-set_index()
- 데이터프레임의 특정 열을 행 인덱스로 설정
- 새로운 데이터 프레임 객체를 반환
- set_index() 메소드를 사용하여 행 인덱스를 새로 지정하면 기존 행 인덱스는 삭제됨

In [305]:
df = pd.DataFrame(exam_data)

In [279]:
df

   이름  수학  음악
0  경민  90  90
1  화정  80  80
2  민지  50  50

In [293]:
# 특정 열을 행 인덱스로 설정

ndf2 = df.set_index(["음악"])

In [294]:
ndf2

    이름  수학
음악
90  경민  90
80  화정  80
50  민지  50

In [299]:
ndf = df.set_index(["이름"]) # 기존에 있던 index 는 없어집니다

In [298]:
ndf

    수학  음악
이름
경민  90  90
화정  80  80
민지  50  50

In [306]:
ndf3 = ndf.set_index(["수학", "음악"])

In [307]:
ndf3

Empty DataFrame
Columns: []
Index: [(90, 90), (80, 80), (50, 50)]

## 행 인덱스 재배열

- reindex()
- 행 인덱스를 새로운 배열로 재지정
- 기존 객체를 변경하지 않고 새로운 데이터 프레임 객체를 반환
- 기존 데이터프레임에 존재하지 않는 행 인덱스가 새롭게 추가되는 경우
- 그 행의 데이터는 NaN 값이 입력
- NaN : Not a Number, 누락데이터

In [308]:
# index 는 파괴적이므로 reindex 를 사용하므로써 원본데이터를 지킬수있죵

In [309]:
df

   수학  음악  과학
0  90  90  90
1  80  80  80
2  50  50  50

In [317]:
df

    c0  c1  c2  c3  c4
r0   1   2   1   1   1
r1   2   3   2   2   2
r2   3   4   3   3   3

In [315]:
df = pd.DataFrame(dict_data, index = ["r0","r1","r2"])

In [316]:
df

    c0  c1  c2  c3  c4
r0   1   2   1   1   1
r1   2   3   2   2   2
r2   3   4   3   3   3

In [319]:
# 인덱스 재지정
new_index = ["r0","r1","r2","r3","r4"]
ndf = df.reindex(new_index)

In [320]:
ndf

     c0   c1   c2   c3   c4
r0  1.0  2.0  1.0  1.0  1.0
r1  2.0  3.0  2.0  2.0  2.0
r2  3.0  4.0  3.0  3.0  3.0
r3  NaN  NaN  NaN  NaN  NaN
r4  NaN  NaN  NaN  NaN  NaN

In [323]:
# reindex 로 발생하는 NaN 값을 0 으로 채우기
ndf2 = df.reindex(new_index, fill_value = 0) # fill_value = 0

In [324]:
ndf2

    c0  c1  c2  c3  c4
r0   1   2   1   1   1
r1   2   3   2   2   2
r2   3   4   3   3   3
r3   0   0   0   0   0
r4   0   0   0   0   0

#### 행 인덱스 초기화

- reset_index()
    - 행 인덱스를 정수형 위치 인덱스로 초기화
    - 기존 행 인덱스는 열로 이동

- 새로운 데이터 프레임 객체를 반환

In [325]:
df

    c0  c1  c2  c3  c4
r0   1   2   1   1   1
r1   2   3   2   2   2
r2   3   4   3   3   3

In [340]:
ndf = df.reset_index()

In [341]:
ndf

   level_0 index  c0  c1  c2  c3  c4
0        0    r0   1   2   1   1   1
1        1    r1   2   3   2   2   2
2        2    r2   3   4   3   3   3

## 행 인덱스를 기준으로 데이터 프레임 정렬

- sort_index()
    - 행 인덱스를 기준으로 데이터프레임의 값을 정렬
    - ascending 옵션을 사용하여 정렬옵션(오름차순|내림차수) 설정
    - ascending = False
        - 내림차순 (decending 은 없습니다 정신차리세요!)
        - 기본값은 True(오름차순)
    
    - 새롭게 정렬된 데이터프레임을 반환

In [328]:
df

  index  c0  c1  c2  c3  c4
0    r0   1   2   1   1   1
1    r1   2   3   2   2   2
2    r2   3   4   3   3   3

In [334]:
# 내림차순으로 행 인덱스 정렬

ndf = df.sort_index(ascending = False)

In [335]:
ndf

  index  c0  c1  c2  c3  c4
2    r2   3   4   3   3   3
1    r1   2   3   2   2   2
0    r0   1   2   1   1   1

In [336]:
df

  index  c0  c1  c2  c3  c4
0    r0   1   2   1   1   1
1    r1   2   3   2   2   2
2    r2   3   4   3   3   3

#### 특정 열의 데이터 값을 기준으로 데이터 프레임 정렬

- sort_values()
- 특정 열의 데이터를 기준으로 데이엍 프레임 정렬
- ascending 옵션을 사용하여 정렬옵션(오름차순|내림차순) 설정
- 기본값은 오름차순

In [349]:
# c1 열을 기준으로

ndf = df.sort_values(by="c3", ascending = False)

In [350]:
ndf

  index  c0  c1  c2  c3  c4
2    r2   3   4   3   3   3
1    r1   2   3   2   2   2
0    r0   1   2   1   1   1

# 산술 연산

- 판다스 객체의 산술연산은 내부적으로 3단계 프로세스
- 1. 행/열 인덱스를 기준으로 모든 원소를 정렬
  2. 동일한 위치에 잇는 원소끼리 일대일로 대응
  3. 일대일 대응이 되는 원소끼리 연산 처리
  4. 대응되는 원소가 없으면 NaN처리

## 시리즈 연산

### 시리즈와 숫자

- 시리즈 객체에 숫자를 더하면 시리즈의 개별 원소에 각각 숫자를 더하고 계산한 결과를 시리즈 객체로 반환

- 덧셈 , 밸셈, 나눗셈, 곱셈 모두 가능

In [351]:
student1 = pd.Series({"국어" : 100 , "영어" : 80, "수학" : 90 })

In [352]:
student1

국어    100
영어     80
수학     90
dtype: int64

In [354]:
result = student1 / 100

In [355]:
result

국어    1.0
영어    0.8
수학    0.9
dtype: float64

In [356]:
type(result)

pandas.core.series.Series

### 시리즈와 시리즈

- 같은 인덱스를 가진 원소끼리 계산
- 인덱스에 연산결과를 매칭하여 새 시리즈를 반환

In [357]:
student2 = pd.Series({"수학" : 80, "국어" : 90, "영어" : 80})

In [358]:
student1

국어    100
영어     80
수학     90
dtype: int64

In [359]:
student2

수학    80
국어    90
영어    80
dtype: int64

In [360]:
student1 + student2

국어    190
수학    170
영어    160
dtype: int64

In [364]:
(student1 + student2).sort_values()

영어    160
수학    170
국어    190
dtype: int64

- 인덱스로 주어진 과목명의 순서가 다르지만 판다스는 같은 과목명을 찾아 정렬한 후 과목명의 점수 끼리 연산을 수행

- 연산을 하는 두 시리즈의 원소의 개수 다르거나 값이 다른경우
- 연산처리는 NaN 으로 나옴

In [365]:
# NaN 값이 있는 시리즈 연산
student1 = pd.Series({"국어":np.nan, "영어" : 80, "수학" : 90})
student2 = pd.Series({"국어" : 80, "수학" : 90})

In [366]:
student1 + student2

국어      NaN
수학    180.0
영어      NaN
dtype: float64

In [367]:
student1 - student2

국어    NaN
수학    0.0
영어    NaN
dtype: float64

### 연산 메소드

- 결과가 NaN 으로 반환되는 상황을 피하기 위해 연산 메소드에 fill_value 옵션을 설정

- 덧셈 : Series1.add(Series2, fill_value = 0)
- 뺄셈 : Series1.sub(Series2, fill_value = 0)
- 곱셈 : Series1.mul(Series2, fill_value = 0)
- 나눗셈 : Series1.div(Series2, fill_value = 0)

In [369]:
student1.add(student2, fill_value = 0)

국어     80.0
수학    180.0
영어     80.0
dtype: float64

In [374]:
student1.mul(student2, fill_value = 0)

국어       0.0
수학    8100.0
영어       0.0
dtype: float64

In [371]:
student1.div(student2, fill_value = 0) # pandas 에서는 무한대로 표기됨

국어    0.0
수학    1.0
영어    inf
dtype: float64

In [372]:
student1.sub(student2, fill_value = 0)

국어   -80.0
수학     0.0
영어    80.0
dtype: float64

## 데이터 프레임 연산

- 데이터프레임은 여러 시리즈가 모인 것이므로 시리즈 연산을 확장하는 개념

- 행/열 인덱스를 기준으로 정렬하고 일대일 대응되는 원소끼리 연산 처리

In [375]:
우어어어어엉어어어엉엉어엉! 우어어어어ㅓ어엉엉! 졸려!!!! 같은 애들끼리 연산 처리한다고~~~~~~~~~~~

SyntaxError: invalid syntax (3276318950.py, line 1)

### 데이터프레임과 숫자

- 모든 원소에 숫자를 계산

- 기존 데이터프레임의 형태를 그대로 유지한 채 원소 값만 새로운 계산으로 바뀜

- 새로운 데이터프레임 객체로 반환

In [385]:
# titanic 데이터셋 로드

titanic = sns.load_dataset("titanic")

titanic.head() # 첫 5행만 표시

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [378]:
type(titanic)

pandas.core.frame.DataFrame

In [388]:
df = titanic[["age", "fare"]]

df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [390]:
addition = df + 10

addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

### 데이터프레임과 데이터프레임

- 각 데이터프레임의 같은 행, 같은 열 위치에 있는 원소끼리 계산

- 동일한 위치의 원소기리 계산한 결과값을 원래 위치에 다시 입력하여 데이터프레임을 생성

- 데이터 프레임 중 어느 한 쪽에 원소가존재하지 않거나 NaN 이면 연산 결과는 NaN

In [391]:
addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

In [392]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [393]:
subtraction = addition - df

subtraction.head()

    age  fare
0  10.0  10.0
1  10.0  10.0
2  10.0  10.0
3  10.0  10.0
4  10.0  10.0